christian-kohler.npm-intellisense
davidanson.vscode-markdownlint
eamodio.gitlens
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-pull-request-github
google.geminicodeassist
hbenl.vscode-test-explorer
littlefoxteam.vscode-python-test-adapter
mechatroner.rainbow-csv
meshintelligenttechnologiesinc.pieces-vscode
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.datawrangler
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.powershell
ms-vscode.test-adapter-converter
ms-vscode.vscode-speech
pkief.material-icon-theme
redhat.vscode-yaml
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
